Can replicate the symptoms here. Name change of the bucket here:

```
# module.aws_eks_audit_log.aws_s3_bucket.log_bucket[0] must be replaced
-/+ resource "aws_s3_bucket" "log_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::lw-eks-alXXXXXXXX-access-logs" -> (known after apply)
      ~ bucket                      = "lw-eks-alXXXXXXXX-access-logs" -> "lw-eks-al-bucket-XXXXXXXX-access-logs" # forces replacement
```

Can't delete the bucket since the `bucket_force_delete` wasn't set:

```
Error: deleting S3 Bucket (lw-eks-alXXXXXXXX): BucketNotEmpty: The bucket you tried to delete is not empty. You must delete all versions in the bucket.
```

Just a heads up that the newly-created example for `use_existing_bucket` is missing a `README`, and presents on the Terraform docs as an internal-only module: https://github.com/lacework/terraform-aws-eks-audit-log/tree/main/examples/use_existing_bucket

![Screenshot 2023-04-24 at 15 36 10](https://user-images.githubusercontent.com/13564686/235394020-12a2557b-241b-41d9-927c-eabe1d0d2b3d.png)
